[
  {
    "path": "posts/DataViz Makeover 2/",
    "title": "DataViz Makeover 2",
    "description": "Public receptivity and perceptions towards COVID-19 vaccinations, Jan 2021",
    "author": [
      {
        "name": "Daniel Lin",
        "url": "https://daniel-lin-yy-data-viz.netlify.app/"
      }
    ],
    "date": "2021-02-19",
    "categories": [],
    "contents": "\r\nBackground\r\nA research team has conducted a study to understand the receptivity of the public towards COVID-19 vaccination. As part of their study, data from the Imperial College London YouGov COVID-19 Behaviour Tracker Data Hub was utilised. From the data obtained, some visualizations were created. The aim of this post is to provide suggestions for improvement of the visualizations as well as to propose other visualizations for further analysis of the data to allow deeper insights to be gleaned.\r\nA. Critique of Data Visualization Provided\r\nThe original visualizations created by the team is shown below.\r\n\r\n\r\n\r\nFigure 1: Provided Data Visualization\r\n\r\n\r\n\r\nBased on the original data visualization provided, the following are some comments on the clarity and aesthetics aspects of the visualization.\r\nClarity\r\n1. Titles of the charts and legends are not well worded The title of the chart on the left could have been better phrased to reflect the content and key message of the chart.  The horizontal axes could have been better labelled to “Proportion of respondents”.  For the vertical axes, it is unnecessary to have the “Country” axis label as the country labels are self-explanatory.  For the legend, there is no need to label “Vac1” as it is not meaningful to the reader. 2. Colour chosen for categories not intuitive Colours selected to represent the categorical responses should reflect the nature of the responses.  For example, Strongly agree (1) and Agree (2) should be of the same colour hue but different in tones/shades to reflect intensity (i.e. (1) should be darker/more intense than (2)). Similarly, Strongly Disagree (5) and Disagree (4) should be of the same colour hue but of different tones/shades to reflect intensity (i.e. (5) should be more intense then (4)).3. Uncertainty in the data was not represented For the chart on the right, since sample proportion was used, confidence intervals of the sample proportion should be included to allow readers to understand the margin of error in the sample estimates and to interpret if the proportions reflected are statistically different. \r\n4. Inclination and skew of responses not easily observed with 100% stacked bar chart While the 100% stacked bar chart demonstrates the proportions of the responses for each country, it does not intuitively show the skew and inclination of the responses for each country at a glance. With a diverging stacked bar chart, the inclinations of the responses is more evident. 5. Insufficient data to draw meaningful observations Both charts essentially reflect countries’ receptivity towards the COVID-19 vaccine. However, no further observations and analysis are available from the charts. In order to glean deeper insights, the data from the variable used (var_1) should be compared with data from other variables for analysis. \r\n6. Bar chart on the right sorted in descending order For the chart on the right, countries are sorted in descending order of the proportion of the public which had strongly agreed to the statement that they were willing to take the vaccine. By arranging in this manner,it allows easier identification of countries which had a higher receptivity towards the vaccine.\r\nAesthetics\r\n1. Horizontal arrangement of the bar chart As the bar charts are labelled according to country names, a horizontal mapping of the bar chart allows the countries’ names to be seem in full and in a less cluttered manner than if arranged in a vertical layout. 2. Country names should be in Title Case instead of lowercase Country names are proper nouns and should be in Title Case instead of the current lowercase used. 3. Consistent use of colours There was consistent use of colours in both graphs, where dark blue was used to represent the proportion of respondents who had strongly agreed.4. Consistency in number of decimals on horizontal axes The chart on the left used whole number labels while the one on the right had labels with 1 decimal place. For consistency and for the charts to look less cluttered, whole number labels could be used.5. Good choice of font type, size and colour Font type, size and colour selected in the chart is an appropriate choice as it is easily read by the reader. However, to emphasize key messages of the chart, annotations of different size and colour could be used.\r\nB. Proposed Alternative Data Visualization\r\nSketch of Proposed Visualization\r\n\r\n\r\n\r\nFigure 2: Sketch of Proposed Data Visualization\r\n\r\n\r\n\r\nDescription of and Rationale for Proposed Visualization\r\n1. Side by side comparison of responses to different questions The proposed visualization would include 2 graphs placed side by side with readers having an option to select the questions (variables) for which the charts are representing. This will allow users to compare responses to the different questions and derive deeper insights into the responses.\r\nFor example, for a country with high proportion of public willing to take the vaccine, a comparison with their responses to other questions such as “I am worried about getting COVID19” or “I believe government authorities in my country will provide me with an effective COVID19 vaccine” could provide deeper understanding on the motivation of respondents’ receptivity towards vaccination. Application wise, public health authorities would be able to determine if there were any public health messaging that would drive vaccination uptake more than others.\r\n2. Filters by demographical factors to allow deeper analysis There are also filters for the chart on the left, to allow users to refine the charts displayed by gender, age range, employment status, household size and number of children in households, which may provide interesting insights into possible factors linked to vaccination receptivity and perceptions.\r\n3. Option to select Confidence Intervals for error bars For the chart on the right, users have the option of selecting 90%, 95% and 99% confidence levels to view the estimated proportions (and their confidence intervals) of respondents strongly agreeing with the respective statements.\r\n4. Use of suitable Title and Write-up  The title and write-up provides context to the visualization and helps the reader understand the utility of the charts.\r\n5. Inttuitive use of colours For the diverging stacked bar chart on the left, colours with same hues but differing tones are used to represent similar responses (i.e., Dark green for Strongly Agree, Green for Agree, Grey for Neutral, and Red and Dark Red for Disagree and Strongly Disagree). This allows for the reader to interpret the charts more easily and intuitively.\r\n6. Use of error bars to represent uncertainty To provide an indication of uncertainty of the sample proportion, error bars are used on the right, with varying levels of confidence. This allows the user to have a better understanding of the uncertainty in data shown as well as whether there were statistical diferences in the estimates for the various countries.\r\n7. Diverging stacked bar charts show skew and inclination intuitively Compared to the 100% stacked bar chart, the diverging bar chart shows skewness and inclination of the proportions more effectively and intuitively. At a glance, the user is able to tell which countries are more or less inclined towards COVID19 vaccination.\r\n8. Both charts sorted by countries’ names in alphabetical order  As the diverging stacked bar chart clearly displays the inclination of the countries, there is no need to sort the error bar chart on the right by decreasing level of willingness. Instead, both were sorted similarly to allow for easy comparison of country data between the 2 charts.\r\nC. Proposed Data Visualization\r\nThe proposed data visualization is found at the following URL:https://public.tableau.com/profile/daniel.lin.yongyan#!/vizhome/DatavizMakeover2_1316h/Dashboard1?publish=yes  A screenshot of the visualization is as follow.\r\n\r\n\r\n\r\nFigure 3: Proposed Data Visualization\r\n\r\n\r\n\r\nD. Preparation of Data Visualization\r\nD1. Preparation of Dataset\r\nD1.1 Extraction of targeted variables from country datasets provided\r\nFor the data visualization, the following variables have been selected for use from the datasets.\r\n\r\n\r\n\r\nFigure 4: Selected Variables\r\n\r\n\r\n\r\nDemographical data such as gender, age, household sizes, employment status, and endtime were extracted as well to provide deeper understanding to the profile of the respondents.\r\n\r\n\r\n\r\nFigure 5: Selected Demographic Variables\r\n\r\n\r\n\r\nFor each of the country datasets, only the above selected fields were extracted from the original datasets. The below is a screenshot of the selected fields retained from the original country dataset.\r\n\r\n\r\n\r\nFigure 6: Extracted variables from original dataset\r\n\r\n\r\n\r\nD1.2 Selection of relevant records\r\nFor the research, only data from January 2021 was used for analysis and visualization. As such, records of responses that were done in January 2021 were extracted from the dataset. This was done by first applying a date filter in the “endtime” column and selecting the relevant records as follow.\r\n\r\n\r\n\r\nFigure 7: Date filter applied to extract Jan 2021 records\r\n\r\n\r\n\r\nThe following is a screenshot of the resulting dataset.\r\n\r\n\r\n\r\nFigure 8: Remaining dataset after extracting Jan 2021 data\r\n\r\n\r\n\r\nD1.3 Recoding of “1 – Strongly agree” and “5 – Strongly disagree”\r\nFor selected fields vac_1, vac2_1, vac2_2, vac2_3, vac2_6 and vac_3, 2 of the data values “1 – Strongly agree” and “5 – Strongly disagree” need to be recoded to numerical values 1 and 5 respectively.\r\nThis is done by using the Replace function as shown below\r\n\r\n\r\n\r\nFigure 9: Replacement of 1 - Strongly agree using the Replace function\r\n\r\n\r\n\r\nand\r\n\r\n\r\n\r\nFigure 10: Replacement of 5 - Strongly disagree using the Replace function\r\n\r\n\r\n\r\nD1.4 Recoding of values in household_children field\r\nBased on the codebook provided (see below), there should not be entries with 7 or 8 in the “household_children” field as these would have been captured under “5 or more”. Rather 8 is supposed to be mapped to “Prefer not to say” and 7 is actually an invalid input value. In some of the countries’ datasets, this has not been properly coded (refer to diagram below).\r\n\r\n\r\n\r\nFigure 11: Error in values of household_children\r\n\r\n\r\n\r\nAs such, values 7 and 8 will be recoded to “Don’t know” and “Prefer not to say” as aligned to the value labels in “household_size”. This is done through the use of the filter function as follow.\r\n\r\n\r\n\r\nFigure 12: Rectified values of household_children\r\n\r\n\r\n\r\nD1.5 Creation of employment_status field\r\nFor some of the country datasets, employment status is recorded in separate fields as shown in the following figure.\r\n\r\n\r\n\r\nFigure 13: Employment status recorded over separate variables\r\n\r\n\r\n\r\nAs such, a new field “employment_status” needs to be created to be consistent with the datasets of the other countries. The formula used to create the new field is as follows.\r\n=IF(G2=“Yes”,“Full time employment”,IF(H2=“Yes”,“Part time employment”,IF(I2=“Yes”,“Full time student”,IF(J2=“Yes”,“Retired”,IF(K2=“Yes”,“Unemployed”,IF(L2=“Yes”,“Not working”,IF(M2=“Yes”,“Other”,0)))))))\r\n\r\n\r\n\r\nFigure 14: Creation of employment_status field\r\n\r\n\r\n\r\nThe cleaned file is then saved with country name in Title case format.\r\nThe above steps are then repeated for each of the country datasets.\r\nD2. Creation of Diverging Stacked Bar Chart\r\nD2.1 Importing of Datasets into Tableau\r\nAll 14 country files were pulled into Tableau and a new column was created from Table Name via the split function to derive the Country variable.\r\n\r\n\r\n\r\nFigure 15: Split function applied to Table Name field\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 16: Creation of Country field\r\n\r\n\r\n\r\nThe responses to the various survey questions were then pivoted together into a single field as shown.\r\n\r\n\r\n\r\nFigure 17: Pivoting of survey responses\r\n\r\n\r\n\r\nThe pivot fields were then renamed to reflect the data they carry (i.e. Questions and Responses) as shown.\r\n\r\n\r\n\r\nFigure 18: Renaming of Pivoted Fields\r\n\r\n\r\n\r\nD2.2 Renaming of data values\r\nFor Response, the data currently are continuous data types. They were converted to Dimensions as follows.\r\n\r\n\r\n\r\nFigure 19: Renaming of Pivoted Fields\r\n\r\n\r\n\r\nThe data values in Response was then re-labelled with their aliases as shown below.\r\n\r\n\r\n\r\nFigure 20: Editing aliases for Response field\r\n\r\n\r\n\r\nThe data in Question field was renamed also to reflect the respective survey questions, for easy reference.\r\n\r\n\r\n\r\nFigure 21: Editing aliases for Question field\r\n\r\n\r\n\r\nD2.3 Creation of Calculated Fields\r\nCalculated fields needed to be created via the Analysis tab as shown below.\r\n\r\n\r\n\r\nFigure 22: Creation of Calculated Field\r\n\r\n\r\n\r\nFormulae for the respective calculated fields were input as shown below.\r\n\r\n\r\n\r\nFigure 23: Creation of Number of Records field\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 24: Creation of Total Count field\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 25: Creation of Count Negative field\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 26: Creation of Total Count Negative field\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 27: Creation of Percentage field\r\n\r\n\r\n\r\nThe Diverging Stacked Bar Chart is actually created using a Gantt chart concept. As such the start point of the Gantt chart is defined as follow.\r\n\r\n\r\n\r\nFigure 28: Creation of Gantt start\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 29: Creation of Gantt Percent\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 30: Creation of Gantt Percent\r\n\r\n\r\n\r\nD2.4 Creation of Chart (using Gantt chart)\r\nBring Gantt Percent into Columns, Country into Rows, Response to the Colour button and Detail button, and Percentage to Size button as shown. Ensure Gantt Percent and Percentage are computed using Response (refer to below).\r\n\r\n\r\n\r\nFigure 31: Creation of Gantt Percent\r\n\r\n\r\n\r\nChange Marks to Gantt Bar as shown.\r\n\r\n\r\n\r\nFigure 32: Create Gantt Chart\r\n\r\n\r\n\r\nNext, bring in the following fields into the Filters panel. For the Response filter, select all except Null to exclude Null responses. For each of the filters, select Show Filter as shown below to get the Filters appearing on the right of the chart.\r\n\r\n\r\n\r\nFigure 33: Creation of Filters (left), select Show Filter (centre), filters appear on the right of chart (right)\r\n\r\n\r\n\r\nSelect appropriate colours for the corresponding Response values as shown.\r\n\r\n\r\n\r\nFigure 34: Selection of colours for Response values\r\n\r\n\r\n\r\nRight click on the horizontal axis and select Edit Axis. Select Reversed so that the Strongly Agree appears on the right. Right click on the axis again and select Format. Input the Custom format as shown (0%;#%) to ensure the percentage labels are in positive values for both sides.\r\n\r\n\r\n\r\nFigure 35: Formatting of horizontal axis\r\n\r\n\r\n\r\nRename the chart by double clicking the title of the chart and editing the title as shown.\r\n\r\n\r\n\r\nFigure 36: Rename title of the chart\r\n\r\n\r\n\r\nD3. Creation of Error Bars\r\nD3.1 Creation of Calculated Fields\r\nFirst create a parameter called “Select Question” with the following list of values.\r\n\r\n\r\n\r\nFigure 37: Creation of Select Question paremeter\r\n\r\n\r\n\r\nThen create No of Records as shown.\r\n\r\n\r\n\r\nFigure 38: Creation of No of Records\r\n\r\n\r\n\r\nCreate a calculated field Strongly Agreed to count the number of respondents who had Strongly Agreed to the question selected (i.e. Question)\r\n\r\n\r\n\r\nFigure 39: Creation of Strongly Agreed field\r\n\r\n\r\n\r\nNow create Prop to compute the proportion who Strongly Agreed.\r\n\r\n\r\n\r\nFigure 40: Creation of Prop field\r\n\r\n\r\n\r\nNext, create Select CI parameter, Prop_SE, Z_value, Prop_Margin of Error, Prop_Lower Limit, Prop_Upper Limit\r\n\r\n\r\n\r\nFigure 41: Creation of Select CI parameter\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 42: Creation of Prop_SE\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 43: Creation of Z_value\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 44: Creation of Prop_Margin of Error\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 45: Creation of Prop_Lower Limit\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 46: Creation of Prop_Upper Limit\r\n\r\n\r\n\r\nD3.2 Creation of Dot Plot with Error Bars\r\nBring Prop and Country in to Columns and Rows fields respectively.\r\n\r\n\r\n\r\nFigure 47: Bring Prop and Country onto canvas\r\n\r\n\r\n\r\nPull Measure Values from the Tables Pane to the top of the chart created as shown below.\r\n\r\n\r\n\r\nFigure 48: Bring Measure Values into chart\r\n\r\n\r\n\r\nTHe resulting chart is as shown. Remove the fields in the Measure Values pane, leaving behind Prop_Lower Limit and Prop_Upper Limit.\r\n\r\n\r\n\r\nFigure 49: Resulting chart\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 50: Chart with only Prop_Upper Limit and Prop_Lower Limit remaining in Measure Values pane\r\n\r\n\r\n\r\nNext, synchornise the horizontal axes as shown.\r\n\r\n\r\n\r\nFigure 51: Synchronize horizontal axes\r\n\r\n\r\n\r\nChange Measure Values to Line as shown.\r\n\r\n\r\n\r\nFigure 52: Change Measure Values to Line\r\n\r\n\r\n\r\nBring Measure Names to the Path icon to arrive at the following chart.\r\n\r\n\r\n\r\nFigure 53: Bring Measure Names to Path Icon\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 54: Resulting Dot Plot with Error Bars\r\n\r\n\r\n\r\nModify the colour and width of the error bars and the dot plots using the Measure Values and AGG(Prop) panes as shown.\r\n\r\n\r\n\r\nFigure 55: Modification of colour and size of error bars and dot plots\r\n\r\n\r\n\r\nSwap Measure Values and AGG(Prop) in the Columns field for the dot plots to appear above the error bars as shown.\r\n\r\n\r\n\r\nFigure 56: Swap Measure Values and AGG(Prop)\r\n\r\n\r\n\r\nFor the 2 parameters created, right click and select “Show Parameter” to display them on the right panel. This will allow users to select the different confidence levels and questions to be displayed on the chart.\r\n\r\n\r\n\r\nFigure 57: Display parameters on the right\r\n\r\n\r\n\r\nRename the chart by double clicking on the title and editing the title in the window that appears as shown.\r\n\r\n\r\n\r\nFigure 58: Rename title of the chart\r\n\r\n\r\n\r\nD4. Creation of Dashboard\r\nBring the 2 charts from the Sheets panel into the dashboard and place them side by side as shown.\r\n\r\n\r\n\r\nFigure 59: Bring created charts onto the dashboard\r\n\r\n\r\n\r\nEdit the size of the dashboard on the left as shown.\r\n\r\n\r\n\r\nFigure 60: Re-size dashboard\r\n\r\n\r\n\r\nShift the elements of the dashboard around to arrived at desired layout.\r\n\r\n\r\n\r\nFigure 61: Drag and move elements in dashboard\r\n\r\n\r\n\r\nRight click on the Select CI parameter and select Floating to position the dropdown list at the desired place.\r\n\r\n\r\n\r\nFigure 62: Make Select CI parameter floating\r\n\r\n\r\n\r\nDrag the Text icon to the top of the dashboard to create a title. Key in the title in the dialogue box that follows.\r\n\r\n\r\n\r\nFigure 63: Create title and sub-title for dashboard\r\n\r\n\r\n\r\nFinally add another text box to the bottom to acknowledge the source of the data. The final layout of the dashboard is as shown.\r\n\r\n\r\n\r\nFigure 64: Completed dashboard\r\n\r\n\r\n\r\nE. Observations from the Proposed Data Visualization\r\n1. United Kingdom (UK) had the greatest receptivity towards COVID-19 vaccination From the figure below, it is observed that respondents from the UK were most inclined and receptive towards COVID-19 vaccination. France on the other hand, seemed to be the least receptive towards vaccination.\r\n\r\n\r\n\r\nFigure 65: Inclination of countries towards vaccination\r\n\r\n\r\n\r\n2. Japan, not France, had the lowest proportion who strongly agreed that they were keen on vaccination From the chart on the right, it would seem that Japan was the least receptive towards the COVID-19 vaccine because of the lowest proportion that agreed strongly to the statement that they were keen on vaccination. However, by inspecting the chart on the left (refer to the orange boxes), it is interesting to note that France was less receptive because of the much larger proportion who strongly disagreed compared to Japan’s. Hence while Japan had a smaller proportion who strongly agreed, they also had a smaller proportion who strongly disagreed compared to France. This is likely arising from cultural differences whereby Japanese are less strong in their opinions compared to the French (with the proportion who are Neutral being twice that of the French).\r\n3. UK and Denmark had significantly higher proportion of respondents who strongly agreed that they were willing to be vaccinated From the chart above (refer to red box), it is observed that UK and Denmark were significantly higher than the other countries at the 99% confidence interval. Countries in the blue region did not have proportions that were statistically different at the 99% confidence level, based on their confidence intervals.\r\n4. Worry of getting COVID does not seem to be a main reason for receptivity towards vaccination From the screenshot below (referring to the blue boxes), countries who were the most receptive towards vaccination did not have very high proportion of respondents who strongly agreed that they were worried about getting COVID-19. On the contrary, Japan which was one of the least receptive, had the highest proportion who strongly agreed they were worried about getting COVID-19. Netherlands and Finland had the lowest proportion who strongly agreed they were worried but their receptivity towards vaccines appear to be among the more receptive countries.\r\n\r\n\r\n\r\nFigure 66: Vaccine receptivity and Worry of getting COVID-19\r\n\r\n\r\n\r\n5. Worry about vaccine side effects seem to affect receptivity towards COVID-19 vaccination From the chart below, it is observed that countries that are more receptive towards vaccination (such as UK, Denmark and Netherlands) have lower concerns towards vaccine side effects. This is evident from the lower proportion of respondents who strongly agreed to the statement that they are worried about vaccine side effects (refer to blue boxes).\r\nOn the contrary, countries which are less receptive, have a higher proportion who strongly agreed that they were worried about vaccine side effects. These countries include France, Japan and Singapore.\r\n\r\n\r\n\r\nFigure 67: Vaccine receptivity and Worry of vaccine side effects\r\n\r\n\r\n\r\n6. Confidence in health authorities providing effective vaccines seemed to be linked to vaccine receptivity In the chart below, with focus on the blue boxes, countries which had the highest receptivity towards vaccination (i.e., Denmark and UK) saw a higher proportion of respondents who strongly agreed that they were confident on effective vaccines being provided. The converse is true as well for countries who were least receptive (e.g., Japan and France)\r\n\r\n\r\n\r\nFigure 68: Vaccine receptivity and Confidence in vaccine efficacy\r\n\r\n\r\n\r\n7. Age is an important factor in receptivity towards vaccine In the figure below, it is observed that in general and across all countries, the older population (aged 78-99 years) were much more receptive towards vaccination as compared to the younger respondents (aged 18-39 years).\r\n\r\n\r\n\r\nFigure 69: Comparison of vaccine receptivity between age groups\r\n\r\n\r\n\r\nConclusion\r\nIn conclusion, the side by side comparison of responses, as well as the breakdown by demographic factors, does reveal interesting patterns of receptivity towards COVID-19 vaccination. Public health authorities would gain much from the close analysis of these factors in the planning of programmes and strategies to increase COVID-19 vaccination.\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/DataViz Makeover 2/OriginalVisual.jpg",
    "last_modified": "2021-02-24T11:29:02+08:00",
    "input_file": "DatavizMakeover2.utf8.md"
  },
  {
    "path": "posts/DataVIz Makeover 3/",
    "title": "DataViz Makeover 3",
    "description": "Public receptivity and perceptions towards COVID-19 vaccinations, Jan 2021",
    "author": [
      {
        "name": "Daniel Lin",
        "url": "https://daniel-lin-yy-data-viz.netlify.app/"
      }
    ],
    "date": "2021-02-19",
    "categories": [],
    "contents": "\r\nTesting\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-21T01:54:31+08:00",
    "input_file": "DataVizMakeover3.utf8.md"
  },
  {
    "path": "posts/DataViz Makeover 1/",
    "title": "DataViz Makeover 1",
    "description": "Visualization on Singapore's Resident Workforce, 2009 - 2019",
    "author": [
      {
        "name": "Daniel Lin",
        "url": "https://daniel-lin-yy-data-viz.netlify.app/"
      }
    ],
    "date": "2021-01-28",
    "categories": [],
    "contents": "\r\nA. Critique of Data Visualization Provided\r\nBased on the original data visualization provided, the following are some comments on the clarity and aesthetics aspects of the visualization.\r\n\r\n\r\n\r\nFigure 1: Provided Data Visualization\r\n\r\n\r\n\r\nClarity\r\nS/N\r\nComments\r\n1\r\nTitle is not well wordedThe title of the chart should provide the reader with an overview of the key message of the chart and not merely mention the data and axes plotted (E.g. Resident labour force by age).\r\n2\r\nNo vertical axis and labels for both axesWhile the title mentioned that the chart reflected Resident Labour Force by Age, it did not specify what the vertical axis represented or how it was computed. Even though there were values provided in the table below the graph, it was not clear if the line graphs were plotted based on those values. There was also no mention on what the values in the table were or how they were computed. The reader is left guessing what the values meant.\r\n3\r\nImproper use of line graphsLine graphs are usually used to display trends in data over time, presenting several data points as one continuous evolution. In this case, bar graphs would be more appropriate for comparing the data across various age-bands which are categorical.\r\n4\r\nLack of annotations and use of data-ink to tell data story and emphasize key messagesThe writeup provided mentioned that the share of resident labour force within 2 age bands, 25-54 and 55 & over, had fallen and risen, respectively. However, this is not immediately evident from the chart since there are no annotations or use of data-ink to guide the reader to the main message.\r\n5\r\nOnly 2 time points provided for comparisonThe chart only provides data at 2 time points, 2009 and 2019. Without the data points in between 2009 and 2019, the reader is not able to tell if there are any particular trends in the data or if the increase or decrease mentioned is a once off comparison.\r\n6\r\nInclusion of data table adds to chart clutterBy including the data table in the chart, the chart appears more cluttered and the reader will find himself distracted, having to cross reference between the points on the line graph and the corresponding values in the table.\r\nAesthetics\r\nS/N\r\nComments\r\n1\r\nColour chosen does not contrast sufficiently with the backgroundThe colour chosen for the 2009 line does not contrast sufficiently with the background and does not stand out easily. A more contrasting colour should be chosen to make the line more easily seen. Alternatively, a white background would have allowed the lines graphs to stand out more prominently.\r\n2\r\nConsistent use of coloursColours used to denote and label the line and data for 2009 (in grey) and 2019 (in blue) have been consistently applied. This allows for easier reference between the set of data in the table and the line graph, though not ideal as mentioned in point 1.\r\n3\r\nElimination of legendTo reduce chart clutter, a legend for the chart was not used. Instead, the line graphs were labelled directly.\r\n4\r\nUse of tick marks to demarcate age-bands on the horizontal axis.Tick marks are usually not used on a categorical scale but more for continuous scales. However in this chart, since a line graph was used for a categorical scale, tick marks were appropriately used to demarcate the age bands on the horizontal axis.\r\n5\r\nGood choice of font type, size and colourFont type, size and colour selected in the chart is an appropriate choice as it is easily read by the reader. However, to emphasize key messages of the chart, annotations of different size and colour could be used.\r\nB. Proposed Alternative Data Visualization\r\nSketch of Proposed Visualization\r\n\r\n\r\n\r\nFigure 2: Sketch of Proposed Data Visualization\r\n\r\n\r\n\r\nAdvantages and Reasons for Proposed Design\r\n1. Use of suitable Title and Write-up  The title and write-up provides context to the visualization and helps the reader zoom in and focus on the key messages and relevant portions of the chart\r\n2. Use of vertical axis and appropriate axes labels  The inclusion of both axes and axes labels allows the reader to have clarity and understand what is depicted in the chart.\r\n3. Data points between 2009 to 2019 provided  The initial provided graph only provided a comparison between 2 years, 2009 and 2019. The increase observed between the 2 years could be a once off and it would not be possible to observe it there was a trend in the data. However, by including the years in between 2009 and 2019, trends in the data can be observed.\r\n4. Appropriate use of Line Graphs  The line graphs used in the top chart allows the reader to visualize trends more easily, since the lines present several data points as one continuous evolution over time. Bar charts were selected for the bottom chart to provide a more visual impact of the absolute numbers of residents in the workforce,for each of the age groups.\r\n5. Use of annotations to highlight key points  Annotations in the chart were used to draw readers’ attention to the key points mentioned in the write-up. This is to allow readers to quickly understand the focus of the charts.\r\n6. Exclusion of Data Table  In the original visualization, a data table was included. This contributed to chart clutter and reduced the clarity of the chart. In the proposed design, data tables were not included but important values were highlighted using annotations where necessary.\r\n7. Selection of colours and fonts to facilitate the reading of charts  The background was kept a consistent white colour, while the colours of text and chart elements were selected to be of a striking colour. This is to allow the reader to more easily read and view the chart elements. Elements which are not key are kept to a lighter shade to reduce distraction from the main elements.\r\n8. Elimination of legends  The use of appropriate labels for the charts meant that there was no need for chart legends as readers can easily identify which age bands the chart elements belonged to. This helped to reduce chart clutter.\r\n9. Consistent use of colours  Colours chosen were consistently applied to elements relating to the same age groups to allow easy referencing by readers and to avoid confusion.\r\nC. Proposed Data Visualization\r\nThe proposed data visualization is found at the following URL:https://public.tableau.com/profile/daniel.lin.yongyan#!/vizhome/DataVizMakeover1_16118057789510/Dashboard?publish=yes  A screenshot of the visualization is as follow.\r\nD. Preparation of Data Visualization\r\n(1) Derivation of Data from MOM’s website\r\nThe data used for the visualization was obtained from the Ministry of Manpower’s (MOM) website (https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx). Of the tables provided, Table 7 (Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009 - 2019 (June)) was used for the data visualisation. \r\n(2) Data cleaning and preparation\r\nTable 7’s data provided the number of residents who were in the resident labour force by 5 year age bands. To prepare the data for analysis, empty columns in the table were removed, and data for the desired age bands (i.e. 15-24yrs, 25-54yrs, 55yrs and above) were derived. A screenshot of the derived table and relevant formulae are as shown below. The formula used are  P2 = =SUM(B2:C2)  Q2 = =SUM(D2:I2)  R2 = =SUM(J2:M2) \r\nTo derive the data for the second chart where Proportion of residents in the workforce for the respective age bands, the following is a screenshot of the derivation carried out.\r\n(3) Import Data to Tableau\r\nThe Excel spreadsheet with the created tables were imported in to Tableau as shown below.\r\n(4) Creation of Visualization - Line Graph\r\nAfter importing the data to Tableau, I started with the creation of the visualization for Proportion of Workforce. * Years (named F1 here) was dragged to the Columns field  * (15-24), (25-54), and (55&Above), which contained the proportion data, were dragged to the Rows field.  * Measure Names was also placed in the Filters field and Colour panel.  The resulting chart is shown as follow.  To remove the legend, the line graphs needed to be labelled. This is done by  * Bringing Measure Names onto the Label panel, and clicking on the Label panel  * Indicating  in the Text field  * Selecting Line Ends and checking Label End of Lines  The following is a screenshot of the step.  The 2 end points of the line graphs were also annotated to allow the reader to easily view and to reinforce the points mentioned in the write-up. This is done by  * Right-clicking on the point  * Select Annotate Mark  * Input as shown below.  The title is also updated as follows.  Next was to fix the Proportion (vertical) axis to 100 to provide an indication of the proportion out of 100%. This is done by right clicking on the vertical axis and selecting Fixed in the dialog box as shown.  The following is the final Line Graph prepared. \r\n(5) Creation of Visualization - Bar Graphs\r\nOn a separate sheet, Year was placed in the Columns field and (15-24),(25-54),(55 & above) were placed in the row field. However, to combine the 3 groups onto the same graph, (25-54) and (55 & above) were dragged to the vertical axis of (15-24) as shown.  The result is as shown.  Then Measure Names was placed in the Colour panel to provide a distinction between the various age bands. The result is as shown.  Following that, similar editing was done (as Line Graphs) to edit the title. The final Bar Chart is as follows. \r\n(6) Creation of Dashboard - Final Visualization\r\nFinally to create the eventual visual, the line graph (Proportion) and bar charts (Absolute) were placed onto the dashboard. One Text field was placed at the top for the Title and Write-Up for the visual and another Text field was placed at the bottom for the Source of the data. The final visual completed is as shown. \r\n\r\nE. Major Observations from the Visualizations\r\n(1) There was a trend in the data of Proportion of Resident Workforce among the age groups.  Proportion of Resident Workforce among 25-54 year olds and those 55 years and above were observed to have a decreasing trend and increasing trend respectively from 2009 to 2019.  With data from 2 years (2009 and 2019), the reader was only able to ascertain whether there was an increase or decrease in the proportion. With the data from every year between 2009 to 2019, trend data is now observed. (2) Actual numbers of 25-54 year olds were increasing while proportion was decreasing.  While the proportion of resident workforce among the 25-54 year olds were decreasing, the actual numbers of the same were actually increasing (as observed in the bar charts).  This would not have been evident if actual figures of the resident workforce among this age group had not been charted and examined. (3) Increase in numbers of resident workforce among older age group is faster than that in the younger age groups.  The bar chart also reveals that number of resident workforce among 55 years and above increased at a faster rate than the increase among the 25-54 years age group.\r\n\r\n\r\n\r\n",
    "preview": "posts/DataViz Makeover 1/OriginalGraph.jpg",
    "last_modified": "2021-02-19T15:35:18+08:00",
    "input_file": "DataVizMakeOver1.utf8.md"
  },
  {
    "path": "posts/2021-01-04-my-first-post/",
    "title": "My First Post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Daniel Lin",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-04-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-08T00:07:22+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to IDEA",
    "description": "Welcome to our new blog, IDEA. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Daniel Lin",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-04T20:58:53+08:00",
    "input_file": {}
  }
]
