[
  {
    "path": "posts/DataViz Makeover 1/",
    "title": "DataViz Makeover 1",
    "description": "Visualization on Singapore's Resident Workforce, 2009 - 2019",
    "author": [
      {
        "name": "Daniel Lin",
        "url": "https://daniel-lin-yy-data-viz.netlify.app/"
      }
    ],
    "date": "2021-01-28",
    "categories": [],
    "contents": "\r\nA. Critique of Data Visualization Provided\r\nBased on the original data visualization provided, the following are some comments on the clarity and aesthetics aspects of the visualization.\r\n\r\n\r\n\r\nFigure 1: Provided Data Visualization\r\n\r\n\r\n\r\nClarity\r\nS/N\r\nComments\r\n1\r\nTitle is not well wordedThe title of the chart should provide the reader with an overview of the key message of the chart and not merely mention the data and axes plotted (E.g. Resident labour force by age).\r\n2\r\nNo vertical axis and labels for both axesWhile the title mentioned that the chart reflected Resident Labour Force by Age, it did not specify what the vertical axis represented or how it was computed. Even though there were values provided in the table below the graph, it was not clear if the line graphs were plotted based on those values. There was also no mention on what the values in the table were or how they were computed. The reader is left guessing what the values meant.\r\n3\r\nImproper use of line graphsLine graphs are usually used to display trends in data over time, presenting several data points as one continuous evolution. In this case, bar graphs would be more appropriate for comparing the data across various age-bands which are categorical.\r\n4\r\nLack of annotations and use of data-ink to tell data story and emphasize key messagesThe writeup provided mentioned that the share of resident labour force within 2 age bands, 25-54 and 55 & over, had fallen and risen, respectively. However, this is not immediately evident from the chart since there are no annotations or use of data-ink to guide the reader to the main message.\r\n5\r\nOnly 2 time points provided for comparisonThe chart only provides data at 2 time points, 2009 and 2019. Without the data points in between 2009 and 2019, the reader is not able to tell if there are any particular trends in the data or if the increase or decrease mentioned is a once off comparison.\r\n6\r\nInclusion of data table adds to chart clutterBy including the data table in the chart, the chart appears more cluttered and the reader will find himself distracted, having to cross reference between the points on the line graph and the corresponding values in the table.\r\nAesthetics\r\nS/N\r\nComments\r\n1\r\nColour chosen does not contrast sufficiently with the backgroundThe colour chosen for the 2009 line does not contrast sufficiently with the background and does not stand out easily. A more contrasting colour should be chosen to make the line more easily seen. Alternatively, a white background would have allowed the lines graphs to stand out more prominently.\r\n2\r\nConsistent use of coloursColours used to denote and label the line and data for 2009 (in grey) and 2019 (in blue) have been consistently applied. This allows for easier reference between the set of data in the table and the line graph, though not ideal as mentioned in point 1.\r\n3\r\nElimination of legendTo reduce chart clutter, a legend for the chart was not used. Instead, the line graphs were labelled directly.\r\n4\r\nUse of tick marks to demarcate age-bands on the horizontal axis.Tick marks are usually not used on a categorical scale but more for continuous scales. However in this chart, since a line graph was used for a categorical scale, tick marks were appropriately used to demarcate the age bands on the horizontal axis.\r\n5\r\nGood choice of font type, size and colourFont type, size and colour selected in the chart is an appropriate choice as it is easily read by the reader. However, to emphasize key messages of the chart, annotations of different size and colour could be used.\r\n\r\n\r\n\r\n",
    "preview": "posts/DataViz Makeover 1/OrigGraph.png",
    "last_modified": "2021-01-28T16:25:42+08:00",
    "input_file": "DataVizMakeOver1.utf8.md"
  },
  {
    "path": "posts/2021-01-04-my-first-post/",
    "title": "My First Post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Daniel Lin",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-04-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-08T00:07:22+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to IDEA",
    "description": "Welcome to our new blog, IDEA. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Daniel Lin",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-04T20:58:53+08:00",
    "input_file": {}
  }
]
